xmlsamples/PI_MTCN/AU-SMV-AIS.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xrsi="http://www.westernunion.com/schema/xrsi">
   <soapenv:Header/>
   <soapenv:Body>
      <xrsi:send-money-validation-request>
         <channel>
            <type>H2H</type>
            <name>ESP</name>
            <version>9500</version>
         </channel>
         <sender>
            <name name_type="D">
               <first_name>uwVWUGPSuJ</first_name>
               <last_name>ZtnCne</last_name>
            </name>
            <address>
               <addr_line1>100 TMP STRT</addr_line1>
               <addr_line2/>
               <city>Melbourne</city>
               <state>Victoria</state>
               <postal_code>1120</postal_code>
               <country_code>
                  <iso_code>
                     <country_code>AU</country_code>
                     <currency_code>AUD</currency_code>
                  </iso_code>
                  <country_name>Australia</country_name>
               </country_code>
               <local_area>FCSS road</local_area>
            </address>
            <compliance_details>
               <template_id>UNI_01</template_id>
               <id_details>
                  <id_type>A</id_type>
                  <id_country_of_issue>Australia</id_country_of_issue>
                  <id_place_of_issue>Australia</id_place_of_issue>
                  <id_number>AWE4983</id_number>
                  <id_issuing_authority>Australia</id_issuing_authority>
                  <id_place_state_of_issue>Australia</id_place_state_of_issue>
               </id_details>
               <id_issue_date>01012019</id_issue_date>
               <id_expiration_date>12112029</id_expiration_date>
               <date_of_birth>01021973</date_of_birth>
               <transaction_reason>Rent/Mortgage</transaction_reason>
               <Country_of_Birth>AUSTRALIA</Country_of_Birth>
               <nationality>AUSTRALIA</nationality>
               <Source_of_Funds>Savings</Source_of_Funds>
               <Nature_of_Work_Business>Administration/Clerical/Facilities Svc</Nature_of_Work_Business>
               <Relationship_to_Receiver_Sender>Friend</Relationship_to_Receiver_Sender>
               <ack_flag>X</ack_flag>
               <employer_status>Employed</employer_status>
            </compliance_details>
            <email>o7tjNWsMLlpBsz@gmail.com</email>
            <contact_phone>2018212100</contact_phone>
            <date_of_birth>01021973</date_of_birth>
            <place_of_birth>Australia</place_of_birth>
            <mobile_phone>
               <phone_number>
                  <country_code>351</country_code>
                  <national_number>913041096</national_number>
               </phone_number>
            </mobile_phone>
            <cpf_tax_id>98812779971</cpf_tax_id>
            <fraud_warning_consent>Y</fraud_warning_consent>
            <sms_notification_flag>N</sms_notification_flag>
         </sender>
         <receiver>
            <name name_type="D">
               <first_name>ahPEdadbsY</first_name>
               <last_name>DRRjuVlBwp</last_name>
            </name>
            <address>
               <addr_line1>P9JUMJ.QS-1FX316-S2BII5994WRGN</addr_line1>
               <addr_line2>W3AA2M/#HXSWD#ZRJ2EK</addr_line2>
               <city>Choloma</city>
               <state>OHRID</state>
               <postal_code>93746</postal_code>
               <country_code>
                  <iso_code>
                     <country_code>HR</country_code>
                     <currency_code>EUR</currency_code>
                  </iso_code>
                  <country_name>CROATIA</country_name>
               </country_code>
               <local_area>FCSS road</local_area>
            </address>
            <email/>
            <contact_phone>0576928014</contact_phone>
            <mobile_phone>
               <phone_number>
                  <country_code>385</country_code>
                  <national_number>6881402081</national_number>
               </phone_number>
            </mobile_phone>
            <reason_for_sending>P001</reason_for_sending>
         </receiver>
         <payment_details>
            <recording_country_currency>
               <iso_code>
                  <country_code>AU</country_code>
                  <currency_code>AUD</currency_code>
               </iso_code>
            </recording_country_currency>
            <destination_country_currency>
               <iso_code>
                  <country_code>HR</country_code>
                  <currency_code>EUR</currency_code>
               </iso_code>
            </destination_country_currency>
            <originating_country_currency>
               <iso_code>
                  <country_code>AU</country_code>
                  <currency_code>AUD</currency_code>
               </iso_code>
            </originating_country_currency>
            <transaction_type>WMN</transaction_type>
            <payment_type>Cash</payment_type>
            <pay_wo_id_indicator>N</pay_wo_id_indicator>
         </payment_details>
         <financials>
            <taxes>
               <tax_rate>0</tax_rate>
               <municipal_tax>0</municipal_tax>
               <state_tax>0</state_tax>
               <county_tax>0</county_tax>
               <tax_worksheet/>
            </taxes>
            <originators_principal_amount>10</originators_principal_amount>
            <destination_principal_amount>100</destination_principal_amount>
            <gross_total_amount>291</gross_total_amount>
            <plus_charges_amount>0</plus_charges_amount>
            <pay_amount>1</pay_amount>
            <charges>290</charges>
            <tolls>0</tolls>
            <originating_currency_principal/>
            <canadian_dollar_exchange_fee>0</canadian_dollar_exchange_fee>
            <message_charge>0</message_charge>
            <money_transfer_limit>100</money_transfer_limit>
         </financials>
         <delivery_services>
            <code>000</code>
         </delivery_services>
         <bank_details>
            <account_number>HR1210010051863000160</account_number>
            <bank_location>Test location</bank_location>
            <bank_account_holder>Test account</bank_account_holder>
         </bank_details>
         <foreign_remote_system>
            <identifier>WGHHAU0600T</identifier>
            <reference_no>USATESTREF</reference_no>
            <counter_id>W06N</counter_id>
         </foreign_remote_system>
      </xrsi:send-money-validation-request>
   </soapenv:Body>
</soapenv:Envelope>